status/2021/02jul21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-28 Sat 07:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>26 June 2021 - 02 July 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">26 June 2021 - 02 July 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org518d354">1. Santa Cruz Weather Station</a>
<ul>
<li><a href="#org7786556">1.1. Next step</a>
<ul>
<li><a href="#orgf4a4e03">1.1.1. Print parts</a></li>
<li><a href="#orgb7d8a93">1.1.2. Order any needed supplies</a></li>
<li><a href="#org9810c74">1.1.3. Assemble and test</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org62e14d3">2. Swocer</a>
<ul>
<li><a href="#org097a52b">2.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org836ca76">3. Linux Audio</a>
<ul>
<li><a href="#org017abef">3.1. Faust programming</a>
<ul>
<li><a href="#org77b6333">3.1.1. Analog Synthesizer modules</a></li>
</ul>
</li>
<li><a href="#orgc6c479d">3.2. Next Steps</a>
<ul>
<li><a href="#org6866fb4">3.2.1. GAC Patch save/restore</a></li>
<li><a href="#org50b4b17">3.2.2. LV2 autopatcher</a></li>
<li><a href="#orga952e81">3.2.3. OSC control surface</a></li>
<li><a href="#org473991d">3.2.4. Faust/csound</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org54cf689">4. EPICS</a>
<ul>
<li><a href="#org2b5041b">4.1. Next steps</a>
<ul>
<li><a href="#org1addb74">4.1.1. u3scpi network port testing</a></li>
<li><a href="#org6c88f8f">4.1.2. initial EPICS interface</a></li>
<li><a href="#org77068b8">4.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgefdff9e">5. Brini Tracker II</a>
<ul>
<li><a href="#orgdb673c4">5.1. Next steps</a>
<ul>
<li><a href="#orgb1aa6f2">5.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org4ff2e1e">5.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#orgca6c50b">5.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org038800a">6. wktcolor</a>
<ul>
<li><a href="#org357f33d">6.1. Next steps</a>
<ul>
<li><a href="#org2d8fbde">6.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org89781a4">7. wktplot</a>
<ul>
<li><a href="#orgbd8ac3b">7.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org8f5acd5">8. ca-r</a>
<ul>
<li><a href="#org40fe907">8.1. Next Step</a></li>
</ul>
</li>
<li><a href="#orge55c923">9. AMDGPU</a>
<ul>
<li><a href="#org9310918">9.1. Next step</a>
<ul>
<li><a href="#orgc71ab4c">9.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org228783b">10. Ninja v Make</a>
<ul>
<li><a href="#org5b3e7e4">10.1. Next Step</a>
<ul>
<li><a href="#org4ec771b">10.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org84914d8">11. GMP Forth</a></li>
</ul>
</div>
</div>
<p>
Almost Independent
</p>

<div id="outline-container-org518d354" class="outline-2">
<h2 id="org518d354"><span class="section-number-2">1.</span> Santa Cruz Weather Station</h2>
<div class="outline-text-2" id="text-1">
<p>
Particle Monitor shelter assemblies checked.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Part</th>
<th scope="col" class="org-right">Quan.</th>
<th scope="col" class="org-left">Designed?</th>
<th scope="col" class="org-left">Fabricated?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Vent connector mount</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent connector cover</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">Vent mount</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM box</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM lid</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM Baffle</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM Screen mount</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">(1)</td>
</tr>

<tr>
<td class="org-left">PM Screen holder</td>
<td class="org-right">2</td>
<td class="org-left">*</td>
<td class="org-left">(1)</td>
</tr>

<tr>
<td class="org-left">PM Inlet shroud</td>
<td class="org-right">1</td>
<td class="org-left">*</td>
<td class="org-left">*</td>
</tr>

<tr>
<td class="org-left">PM box mount</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Vent/UV mount</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">PM Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">UV Cable assembly</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-org7786556" class="outline-3">
<h3 id="org7786556"><span class="section-number-3">1.1.</span> Next step</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgf4a4e03" class="outline-4">
<h4 id="orgf4a4e03"><span class="section-number-4">1.1.1.</span> Print parts</h4>
</div>
<div id="outline-container-orgb7d8a93" class="outline-4">
<h4 id="orgb7d8a93"><span class="section-number-4">1.1.2.</span> Order any needed supplies</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
DB9 shells, jack screws, connectors, etc.
</p>
</div>
</div>
<div id="outline-container-org9810c74" class="outline-4">
<h4 id="org9810c74"><span class="section-number-4">1.1.3.</span> Assemble and test</h4>
</div>
</div>
</div>

<div id="outline-container-org62e14d3" class="outline-2">
<h2 id="org62e14d3"><span class="section-number-2">2.</span> Swocer</h2>
<div class="outline-text-2" id="text-2">
<p>
What a pain. Started adding classes to support 'bottle'
demo. Started crashing left and right. Probably incomplete
interface between OCC memory handling and ruby. Also turns out that
the packed I was using was deprecated last year. That explains why the OCC
API have been stable (!). Changed from the 'oce' to 'opencascade' package,
with the attendant API changes. Need to consider if swocer is sustainable
or if there's a different way of using OCC that makes the ruby interface
less problematic.
</p>
</div>

<div id="outline-container-org097a52b" class="outline-3">
<h3 id="org097a52b"><span class="section-number-3">2.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>

<div id="outline-container-org836ca76" class="outline-2">
<h2 id="org836ca76"><span class="section-number-2">3.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org017abef" class="outline-3">
<h3 id="org017abef"><span class="section-number-3">3.1.</span> Faust programming</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org77b6333" class="outline-4">
<h4 id="org77b6333"><span class="section-number-4">3.1.1.</span> Analog Synthesizer modules</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Waveshaper, Frequency Shifter, Karplus-Strong Plucked String
</p>
</div>
</div>
</div>
<div id="outline-container-orgc6c479d" class="outline-3">
<h3 id="orgc6c479d"><span class="section-number-3">3.2.</span> Next Steps</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org6866fb4" class="outline-4">
<h4 id="org6866fb4"><span class="section-number-4">3.2.1.</span> GAC Patch save/restore</h4>
</div>
<div id="outline-container-org50b4b17" class="outline-4">
<h4 id="org50b4b17"><span class="section-number-4">3.2.2.</span> LV2 autopatcher</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</div>
<div id="outline-container-orga952e81" class="outline-4">
<h4 id="orga952e81"><span class="section-number-4">3.2.3.</span> OSC control surface</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</div>
<div id="outline-container-org473991d" class="outline-4">
<h4 id="org473991d"><span class="section-number-4">3.2.4.</span> Faust/csound</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
See if a faust generated unit works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org54cf689" class="outline-2">
<h2 id="org54cf689"><span class="section-number-2">4.</span> EPICS</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2b5041b" class="outline-3">
<h3 id="org2b5041b"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org1addb74" class="outline-4">
<h4 id="org1addb74"><span class="section-number-4">4.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org6c88f8f" class="outline-4">
<h4 id="org6c88f8f"><span class="section-number-4">4.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-org77068b8" class="outline-4">
<h4 id="org77068b8"><span class="section-number-4">4.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orgefdff9e" class="outline-2">
<h2 id="orgefdff9e"><span class="section-number-2">5.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-5">
<p>
Still working!
</p>
</div>
<div id="outline-container-orgdb673c4" class="outline-3">
<h3 id="orgdb673c4"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgb1aa6f2" class="outline-4">
<h4 id="orgb1aa6f2"><span class="section-number-4">5.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org4ff2e1e" class="outline-4">
<h4 id="org4ff2e1e"><span class="section-number-4">5.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-orgca6c50b" class="outline-4">
<h4 id="orgca6c50b"><span class="section-number-4">5.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org038800a" class="outline-2">
<h2 id="org038800a"><span class="section-number-2">6.</span> wktcolor</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org357f33d" class="outline-3">
<h3 id="org357f33d"><span class="section-number-3">6.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org2d8fbde" class="outline-4">
<h4 id="org2d8fbde"><span class="section-number-4">6.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org89781a4" class="outline-2">
<h2 id="org89781a4"><span class="section-number-2">7.</span> wktplot</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgbd8ac3b" class="outline-3">
<h3 id="orgbd8ac3b"><span class="section-number-3">7.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org8f5acd5" class="outline-2">
<h2 id="org8f5acd5"><span class="section-number-2">8.</span> ca-r</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org40fe907" class="outline-3">
<h3 id="org40fe907"><span class="section-number-3">8.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-8-1">
<p>
None, but expecting ca-tier to break now that the tier system is
deprecated. Looks like thet just stopped updating the data file.
</p>
</div>
</div>
</div>

<div id="outline-container-orge55c923" class="outline-2">
<h2 id="orge55c923"><span class="section-number-2">9.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org9310918" class="outline-3">
<h3 id="org9310918"><span class="section-number-3">9.1.</span> Next step</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgc71ab4c" class="outline-4">
<h4 id="orgc71ab4c"><span class="section-number-4">9.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-org228783b" class="outline-2">
<h2 id="org228783b"><span class="section-number-2">10.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org5b3e7e4" class="outline-3">
<h3 id="org5b3e7e4"><span class="section-number-3">10.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org4ec771b" class="outline-4">
<h4 id="org4ec771b"><span class="section-number-4">10.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-org84914d8" class="outline-2">
<h2 id="org84914d8"><span class="section-number-2">11.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-11">
<p>
Need to think about adding floating point support
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-01-28 Sat 07:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
